In [7]:
import pandas as pd
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

df = pd.DataFrame(x)
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [9]:
x = df[["ID"]]
x

   ID
0   1
1   2
2   3
3   4

In [11]:
type(x)

pandas.core.frame.DataFrame

In [17]:
df.iloc[1,0]

'John'

In [31]:
df.loc[1:3, 'ID':'Department']

   ID      Department
1   2  Software Group
2   3     Design Team
3   4  Infrastructure